<a href="https://colab.research.google.com/github/devindianushika/data_analysis1/blob/master/Test1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

** Data Analysis Test1**

In [ ]:
import pandas as pd

create data frame as df,load csv file and put header as none,otherwaise 1st data raw will be the column names

In [16]:
df = pd.read_csv('test.csv',header=None)
df.head()
df.head(3)

         0   1       2        3
0  devindi  25  174057  gtghyyy
1  hashini  24  174073  fmgjukl
2   saduni  24  174071   kliopy

In [ ]:
col_names =["name","age","index_num","title"]
col_names

['name', 'age', 'index_num', 'title']

In [ ]:
df.columns

Int64Index([0, 1, 2, 3], dtype='int64')

In [ ]:
df.columns = col_names

In [ ]:
col_names

['name', 'age', 'index_num', 'title']

adding column names

In [ ]:
df.head()

      name  age  index_num    title
0  devindi   25     174057  gtghyyy
1  hashini   24     174073  fmgjukl
2   saduni   24     174071   kliopy
3  rajitha   23     174047   fgtyui
4    kamal   22     174051   hjukio

In [ ]:
df.tail()

      name  age  index_num    title
0  devindi   25     174057  gtghyyy
1  hashini   24     174073  fmgjukl
2   saduni   24     174071   kliopy
3  rajitha   23     174047   fgtyui
4    kamal   22     174051   hjukio

save the new file and put index false,because we dont  want index column

In [ ]:
df.to_csv("test_with_col",index=False)